{"id": "7fddc979-0c03-41b7-9665-20dc5fe70815", "page_content": "We offer free returns within 30 days of purchase. Items must be unused, in their original packaging, \nand with all tags attached ; Some products (e.g., final sale, personalized, or hygiene items) may not be \neligible for return.  \nTo begin a return or exchange, visit our Returns Center on the website or contact our customer \nservice team. You’ll need your order number and email address ; We’ll provide a prepaid shipping \nlabel and instructions.  \nReturns or exchanges are typically processed within 5 –7 business days after we receive your item ; \nRefunds will be issued to your original payment method once the return is approved.  \nWe accept major credit and debit cards, UPI, PayPal, and cash on delivery (COD) for select locations.  \nYes, you can select your preferred payment method at checkout, including credit/debit card, UPI, \nPayPal, or COD where available.  \nPayments may be declined due to insufficient funds, incorrect details, or technical issues ; Please \ncheck your payment info, try another method, or contact your bank.  \nAll payment processing is handled with industry -standard encryption and PCI -compliance for your \nsafety.  \nShipping costs depend on your location and selected shipping method ; Standard shipping is often \nfree for orders over a certain amount; details are shown at checkout.  \nWe offer standard, expedited, and express shipping ; Available options and delivery times are \ndisplayed during checkout.  \nDelivery time depends on your location and the selected shipping method ; Standard shipping \ntypically takes 3 –7 business days.  \nYes, International shipping is available to most countries ; Additional fees or customs charges may \napply.  \nAfter your order ships, you’ll receive a tracking link via email ; You can also track your order in your \naccount dashboard.  \nOrders can be changed or cancelled within one hour of placing them ; Contact customer service as \nsoon as possible for assistance.  \nI you received the wrong or a damaged item , Please contact customer service with your order \ndetails and photos of the item ; We’ll arrange a replacement or refund promptly.  \nIf your order hasn’t shipped yet, contact customer service to update your address ; Orders already \nshipped cannot be redirected.  \nTo apply a promo code or discount  Enter your promo code in the 'Discount Code' box at checkout, \nthen click 'Apply' to see your savings.  \nYes, we offer gift wrapping and can include a personalized message ; Select these options at checkout.  \nYou can view your order status in your account dashboard or via the tracking link emailed to you.  \nYes, you’ll receive an email when your order ships that includes tracking information.  \nClick 'Sign Up' on our website and enter your info to create a new account.  \nClick 'Forgot Password' on the login page and follow the instructions to reset your password.  \nLog in to your account and visit 'Account Settings' to update your personal information, address, \npayment methods  or other account details . \nCheck the tracking link in your shipping email or your account dashboard for up -to-date location and \ndelivery info  of your order . \nStart a return in our Returns Center, print the prepaid shipping label, and send the item back in \noriginal condition.  \nDelivery times and costs are shown at checkout based on your location and shipping preference.  \nIf your order is marked as delivered but not received, contact customer service and we’ll help resolve \nthe issue.  \nShare photos and your order details with customer service; we’ll replace or refund your item \npromptly  if it is defective . \nYou can reach our customer service  via live chat, email, or phone ; Find contact links on the website \nfooter and help page.  \nCheck product sizing charts and details before ordering, or reach out for help choosing the right \nproduct.  \nContact service quickly before shipping to change your details ; After shipping, changes may not be \npossible.  \nYes, you can place an order as a guest; You’ll just need to provide your shipping details and email at \ncheckout; However, if you create an account, you’ll get benefits like tracking past purchases, saving \naddresses for faster checkout, and earning rewards on eligible orders.  \nDefinitely! Guest checkout is available for convenience; Keep in mind though, without an account \nyou won’t be able to easily reorder items, save payment preferences, or check your order history in \nthe future.  \nOnce your order is placed, you’ll see a confirmation page with your order number; You’ll also receive \na confirmation email within a few minutes; If you don’t get the email, it may be in your spam/junk \nfolder, or you can check the “My Orders” section if you  created an account.  \nSometimes confirmation emails are delayed or end up in spam/junk folders; Please check there first; \nIf it’s still missing after 15 –20 minutes, it may mean there was a typo in your email or a technical \nglitch; Contact customer support with your payment refe rence and they can confirm your order for \nyou.  \nYes, you can add as many items as you want into your cart and check them out together; If you want \nto create separate orders, you can also do that in multiple transactions; Many customers prefer \nseparate orders if they’re shipping to different addresses or  using separate payment methods.  \nRight now, we process each order as a single shipment; If you want items shipped to different \nlocations, you’ll need to place separate orders; This helps us avoid confusion with addresses and \nensures faster delivery.  \nThere’s no minimum order value — you can buy even a single product; However, certain promotions \nlike free shipping might apply only after you cross a specific order amount, which will be shown \nclearly at checkout.  \nWe don’t support future scheduling for all orders; but in some areas, delivery partners allow you to \nselect a preferred delivery slot; This option, if available, will be shown during checkout.  \nYes, bulk discounts are available for larger quantities; If you’re planning to place a corporate, \nwholesale, or bulk order, it’s best to contact our sales team directly; They’ll guide you with pricing \nand special offers.  \nYes, if you have an account, you can simply go to your “Order History” and reorder past items in one \nclick; This is especially useful if you’re buying essentials or products you use frequently.  \nYes, EMI options are available on supported cards; This allows you to pay in smaller installments \ninstead of the full amount at once; The eligibility and terms depend on your card provider.  \nYes, wallets like Google Pay and Apple Pay are supported; They offer a faster and secure checkout \nexperience by letting you pay with just a tap.  \nA nominal COD handling fee may apply in some areas; This helps cover additional processing and \nhandling costs linked to cash payments.  \nYes, we accept most international credit/debit cards; Make sure your card is enabled for international \ntransactions by your bank before you place an order.  \nYou’ll be charged in the currency shown at checkout; If you’re ordering internationally, your bank \nmay apply a currency conversion fee.  \nDouble charges are usually temporary authorizations and clear automatically; If they don’t, please \ncontact your bank and our support team with transaction details.  \nYes, GST invoices can be downloaded from your account; This is especially useful if you’re buying for \nbusiness purposes.  \nPayment methods can’t be changed once an order is placed; If you want to use a different payment \noption, you’ll need to cancel and reorder.  \nCorporate billing is available for registered businesses; Our team can assist you with special invoicing \nrequirements.  \nGift cards or store credits can be applied at checkout in the “Apply Gift Card” section; The balance is \nautomatically deducted from your order total.  \nAt present, courier services are auto -assigned; preference isn’t available; We work with trusted \ndelivery partners to ensure safe and timely shipping.  \nDeliveries to P .O. boxes aren’t supported; Please use a complete residential or office address for \ndelivery.  \nWeekend delivery is possible in selected cities; Availability will be shown during checkout if \nsupported in your area.  \nIf you miss delivery, the courier will attempt again or leave pickup instructions; You may also \nreschedule delivery through their link if available.  \nSome couriers may call before delivery; but it’s not guaranteed; Always keep your phone number \nupdated to avoid delivery issues.  \nDelivery time slots can be changed via courier link if available; If not, you can contact the courier \ndirectly for assistance.  \nYes, COD orders can be paid in cash to the delivery agent; Please keep the exact change ready if \npossible.  \nTo avoid customs delays, ensure accurate shipping information; Be prepared for duties or additional \ncharges when importing products.  \nA single order cannot be split across multiple addresses; To ship to different addresses, place \nseparate orders.  \nIf your package is stuck in transit, contact support with your tracking ID; We’ll coordinate with the \ncourier to resolve the issue.  \nYes, sale items can usually be returned unless marked “final sale”; Make sure to check the product \npage for details before purchasing.  \nGift cards are non -refundable; Once purchased, they can only be redeemed against future orders.  \nExchanges are only possible for the same product type; If you want something different, you’ll need \nto return the item and place a new order.  \nItems outside the return window may be covered under warranty if applicable; Please check the \nwarranty details on the product page.  \nOriginal invoice isn’t mandatory; order ID is enough; Our team can verify your purchase through your \naccount or email.  \nStore drop -off returns are available only where we have physical outlets; Otherwise, returns must be \nshipped back using the label provided.  \nIf your return label fails, contact support for a new one; We’ll email you a replacement immediately.  \nRefund progress can be checked in your account or via support; Updates will also be sent to your \nemail.  \nRefunds usually reflect in 5 –10 business days depending on your bank; Wallet refunds may be faster.  \nShipping charges are non -refundable unless the product was defective or wrongly shipped.  \nPromo codes may fail if expired or product -ineligible; Always check terms and conditions listed with \nthe code.  \nOnly one promo code can be used per order; Combining codes is not supported.  \nYes, students get special discounts upon verification; You’ll need to upload a valid student ID.  \nYes, military and first responder discounts are available; Verification is required during checkout.  \nDiscounts usually apply to prepaid orders, not COD; This ensures faster processing and reduced risk.  \nYes, festival and seasonal sales run at specific times; Keep an eye on our homepage and emails for \nannouncements.  \nLoyalty points and promo codes can’t be combined; You can choose whichever offers the better \ndiscount.  \nYes, referral rewards are offered when your invitee completes their first order; Credits will be added \nto your account automatically.  \nYou can join the rewards program by signing up on our site; Points are earned on every eligible \npurchase.  \nYes, loyalty points expire after a set period; You’ll be notified before they expire so you can use them \nin time.  \nYes, accounts can be permanently deleted by raising a request; Once deleted, all data and order \nhistory will be removed.  \nIf hacked, reset your password and inform support immediately; We’ll secure your account and \ninvestigate unauthorized access.  \nYes, login with Google, Facebook, or Apple is supported; This gives you quicker access without \ncreating a new password.  \nYou can unsubscribe via email footer or account settings; You’ll still receive order -related updates.  \nYes, you can store multiple shipping addresses in your profile; This makes checkout faster next time.  \nYes, you can update your email from account settings; A verification link will be sent to the new \nemail.  \nIf login fails, ensure you’re using the latest password reset link; Sometimes old links expire quickly.  \nCard data is encrypted and stored securely; We comply with global payment security standards.  \nSharing accounts isn’t recommended due to security risks; It may also cause issues with loyalty \npoints or returns.  \nYes, 2FA can be enabled in security settings; This adds an extra layer of protection to your account.  \nEnable back -in-stock alerts on product pages to be notified; You’ll get an email as soon as the item is \navailable.  \nYou can request restocking, and our team reviews demand; Restocking isn’t guaranteed but we do \nour best.  \nYes, some products include warranties as stated in their descriptions; The duration varies by product \ntype.  \nYes, many of our products are made with sustainable practices; Look for eco -friendly tags on the \nproduct page.  \nCheck authenticity by reviewing brand certifications on product pages; We only partner with verified \nsuppliers.  \nYes, detailed size charts are available for all apparel; Use them to avoid fitting issues.  \nYes, we offer custom packaging on request; This is especially popular for gifting.  \nYes, all items pass a quality check before dispatch; Defective products are not shipped.  \nSubscription options are available for select products; You can manage these from your account.  \nYes, pre -orders are accepted for upcoming launches; Estimated delivery dates are shown at checkout.  \nTry refreshing or using a different browser; If unresolved, contact support with details of the issue.  \nPayment failures may occur due to gateway issues — retry after some time; If the issue persists, use \na different payment method.  \nIf the app crashed, check your email for confirmation before reordering; If no confirmation, the \npayment likely didn’t go through.  \nMake sure the promo code is valid on the app platform; Some codes are web -only or app -only.  \nCart clearing can happen due to session expiry; Log in to ensure your cart is saved.  \nTracking links may take 24 hours to activate after dispatch; Try again later if it’s blank.  \nYes, support via WhatsApp chat is available; You can connect through the website’s help section.  \nOTP delays may be network -related; Request again after a minute or switch to an alternative login \nmethod if available.  \nClear browser cache/cookies in settings to resolve errors; This often fixes loading issues.  \nCurrently, we don’t have a desktop app; You can access our services through the website instead.  \nYes, our support team is available 24/7; You can reach out via chat, email, or phone anytime.  \nYes, you can request to speak to a live agent anytime; Simply type 'talk to agent' in chat.  \nEmail responses usually take 24 –48 hours; For urgent issues, use live chat or phone.  \nYes, support is provided in multiple languages; Choose your language preference when connecting.  \nYes, you can request a callback from our team; Enter your details in the support form.  \nComplaints can be filed directly via the help center; Our team will investigate promptly.  \nEscalation to a manager is possible on request; Just mention it to the support agent.  \nYes, we maintain offline service centers in select cities; You can visit them for returns or support.  \nYes, live chat works in both desktop and mobile apps; It’s the fastest way to get help.  \nYes, past support chats are stored for reference; They help us resolve recurring issues better.  \nYes, our privacy policy is available on the website; It explains how we collect, use, and safeguard \ndata.  \nPersonal data is collected only for order processing and never sold; We use secure systems to protect \nit. \nYes, warranty laws apply where relevant; Product -specific warranty terms are listed in their \ndescriptions.  \nYes, we comply with GDPR regulations; You can request data access or deletion anytime.  \nDisputes are handled via refunds or replacements, depending on case; Chargeback requests are \nsupported too.  \nCounterfeit claims are thoroughly investigated with full refunds if valid; Supporting documents may \nbe required.  \nTerms & conditions are updated regularly and published online; You’ll be notified if major changes \noccur.  \nYes, you can request your purchase history anytime; It can be downloaded from your account \nsettings.  \nWe follow PCI DSS standards for secure payments; This ensures your card details remain protected.  \nNo, there are no hidden charges; All taxes, shipping, or fees are shown transparently before \ncheckout.  \nNo, items must be unused to be eligible for return; Worn items cannot be accepted for hygiene and \nquality reasons; We recommend trying items immediately upon receipt and consulting our size \ncharts before purchasing to ensure proper fit.  \nYou can still return the item using your order number and the email address used for purchase; \nThese serve as proof of purchase in our system; If you can't find your order confirmation email, check \nyour spam folder or contact customer service for assistanc e retrieving your order information.  \nYes, you can process a direct exchange through our Returns Center; Select \"Exchange\" instead of \n\"Return\" when initiating the process; We'll send your replacement item with a prepaid label to \nreturn the original, saving you time in the exchange process.  \nContact customer service immediately; We'll generate a new prepaid label within 24 hours and \nextend your return window accordingly; Keep any shipping receipts as proof of return initiation, and \nmost carriers can manually process shipments using the trackin g number if scanning fails.  \nNo, refunds are issued at the price you paid; Sale items are refunded at the sale price, not the \noriginal retail price; This policy ensures fairness and prevents exploitation of our return system; The \ndiscounted amount you originally paid is what you'll re ceive as a refund.  \nOnce you have the tracking receipt showing the item was shipped back to us, you're not liable; We'll \nprocess your refund even if the package gets lost in transit; Keep your tracking receipt as proof, and \nwe'll handle any carrier investigations for lost ret urn packages.  \nBundle items typically need to be returned as a complete set; Individual items from bundles cannot \nbe returned separately since they're priced as package deals; However, if one item is defective, \ncontact customer service to discuss possible exceptions for partial returns or replacements.  \nReturns beyond 30 days are evaluated case -by-case; Contact customer service to discuss options, \nthough approval isn't guaranteed; We consider extenuating circumstances like medical emergencies, \ndeployment, or natural disasters; Items must still be unused w ith original packaging and tags.  \nThis depends on our store policy; Contact customer service to check if in -store returns are accepted \nfor online purchases at your preferred location; You'll typically need your order confirmation email \nand valid ID if in -store returns are available.  \nContact customer service immediately; We'll help coordinate returning your item and ensure the \ncorrect return is processed; Our warehouse team can identify mismatched returns, and we'll arrange \nto send back items that don't belong to your return authorizati on. \nCurrently, only one payment method can be used per order; You cannot split payments across \nmultiple cards or methods; However, you can use gift cards in combination with another payment \nmethod - the gift card balance is applied first, then the remaining am ount is charged to your selected \npayment method.  \nIf an order fails after payment, the charge will be automatically reversed within 3 -5 business days; \nContact us if you don't see the reversal by then; Sometimes authorization holds appear immediately \nwhile actual charges take time to process, which can cau se temporary confusion.  \nYes, you can save multiple credit/debit cards and PayPal accounts in your account settings for faster \ncheckout; All payment information is encrypted and stored securely; You can set a default payment \nmethod and easily switch between saved options during ch eckout.  \nAbsolutely; We use SSL encryption and are PCI DSS compliant; Your payment information is never \nstored on our servers - it's processed through secure payment gateways; Look for the padlock icon in \nyour browser's address bar to confirm the secure connection.  \nYes, gift card balances are applied first, and any remaining amount can be paid with your preferred \npayment method; If your gift card covers the full order amount, no additional payment is needed; \nYou can check your gift card balance in your account or by contacting customer service.  \nContact your bank to whitelist our website; You can also try using PayPal or a different card as an \nalternative; Banks sometimes flag unfamiliar online merchants as a security precaution; Providing \nour company name and website to your bank usually resolves  the issue quickly.  \nYes, detailed receipts are emailed after purchase and available in your account dashboard; These \ninclude all necessary tax information, itemized pricing, and transaction details; You can download \nand print receipts anytime from your order history for recor d-keeping or tax purposes.  \nWe reserve the right to cancel orders with obvious pricing errors and will notify you immediately \nwith options for reordering at the correct price; While we strive for accuracy, occasional system \nerrors can cause incorrect pricing; We'll honor reasonable p ricing mistakes but reserve the right to \ncancel clearly erroneous orders.  \nYes, we accept major international credit cards; Currency conversion will be handled by your bank at \ntheir current exchange rates; Some international cards may require additional verification steps \nduring checkout, and your bank may charge foreign transacti on fees depending on your card terms.  \nVisit your account settings and update your payment methods; Changes will apply to future recurring \ncharges; Make sure to update before your next billing cycle to avoid payment failures; You can also \nchange your default payment method for all future orders . \nContact customer service immediately; We may require a police report for high -value items before \nproviding a replacement or refund; Consider having packages delivered to your workplace, using \ndelivery instructions for secure placement, or requesting signat ure confirmation for valuable orders \nto prevent theft.  \nYes, you can specify a different shipping address during checkout; Your card issuer may require \nadditional security verification when addresses don't match; This is common for gifts, workplace \ndelivery, or temporary address situations; Ensure all address information is accurate to prevent \ndelivery issues.  \nDelivery attempts vary by carrier; Most will leave a notice and attempt redelivery or hold the package \nat a local facility for pickup; You can often provide delivery instructions during checkout, such as \nleaving packages with neighbors or in secure locatio ns, to ensure successful delivery.  \nP .O. Box shipping availability depends on the carrier and item size; Military addresses are supported \nwith extended delivery times; Some carriers cannot deliver large items to P .O. Boxes, so a physical \naddress may be required for certain orders; APO/FPO ad dresses are treated as international shipping \nwith longer delivery windows.  \nDon't accept damaged packages if possible; If already accepted, contact us within 24 hours with \nphotos for a replacement or refund; Take pictures of both the packaging and the damaged item; \nWe'll file a claim with the carrier and arrange for a replacement to be sent immediately.  \nIf your order hasn't shipped yet, contact customer service within one hour to upgrade shipping; \nAdditional fees will apply based on the new shipping method selected; Once an order has been \nprocessed for shipping, we cannot change the shipping method, but y ou can track its progress.  \nShipping carriers may experience delays during holidays or severe weather; We'll notify you of any \nsignificant delays affecting your order; During peak seasons like Christmas or major storms, delivery \ntimes may extend beyond normal estimates; We recommend ordering early during holiday seasons.  \nCurrently, all items in a single order must ship to the same address; Place separate orders for \ndifferent shipping addresses; This limitation helps ensure accurate delivery and tracking; Each \nseparate order will have its own tracking number and delivery ti meline.  \nThis is considered a carrier error; Contact customer service with your tracking information, and we'll \ninvestigate with the shipping company; We'll work to locate your package or arrange for a \nreplacement; Provide any details about your neighborhood or sim ilar addresses that might have \ncaused confusion.  \nOur estimates are based on typical carrier performance but aren't guaranteed; Weather, holidays, \nand other factors can cause delays; Estimates are calculated from the ship date, not the order date; \nDuring peak seasons or in remote areas, deliveries may tak e longer than estimated.  \nThe recipient is responsible for all customs duties, taxes, and import fees in their country; These \ncharges are separate from our shipping fees and are collected by your local customs authority; Duty \namounts vary by country and product type, and we cannot predict these costs in advance.  \nCustoms delays are beyond our control; Contact your local customs office for information about \nreleasing your package; You may need to provide additional documentation or pay duties before \nrelease; Customs processing times vary significantly by country and  can range from days to weeks.  \nYes, but return shipping costs are your responsibility unless the item was defective or incorrect; \nInternational returns may take longer to process due to shipping times and customs clearance; \nConsider the return shipping cost versus the item value when de ciding whether to return \ninternational orders.  \nWe'll need accurate product descriptions and values; Providing false information can result in \npackage seizure by customs authorities; Customs forms must include honest declarations of contents \nand value; Undervaluing items or mislabeling contents is illeg al and can cause serious delivery issues.  \nYes, certain items may be restricted based on destination country regulations; These restrictions are \nshown at checkout when you enter your shipping address; Common restrictions include electronics, \ncosmetics, food items, and certain materials depending on  the destination country's import laws.  \nInternational orders lost in transit are investigated with the carrier, but resolution times may be \nlonger than domestic orders; International shipping involves multiple carriers and customs agencies, \nmaking investigations more complex; We'll work with all  parties involved to locate your package or \narrange a resolution.  \nTracking availability varies by destination country and local postal service capabilities; Some countries \nprovide limited tracking information once packages enter their postal system; We'll provide all \navailable tracking information, but tracking may becom e less detailed for the final delivery portion in \nsome countries.  \nWe typically charge in USD, and your bank handles currency conversion at their current exchange \nrates; Some regions may see local currency options at checkout; Your bank or card issuer will convert \nthe amount and may charge foreign transaction fees dependi ng on your account terms.  \nYes, remote locations may incur additional shipping charges, which will be calculated at checkout \nbased on your specific address; Rural or remote areas often require additional handling or special \ndelivery services, resulting in higher shipping costs than urban areas.  \nIf new regulations prevent delivery, we'll work with you on alternative solutions, including refunds if \nnecessary; Import regulations can change with little notice; If your package cannot be delivered due \nto regulatory changes, we'll explore options like r erouting to a different address or providing a full \nrefund.  \nTry resetting your password first using the \"Forgot Password\" link; If that doesn't work, contact \ncustomer service to verify your account status; Common issues include typing errors, caps lock being \non, or accounts being temporarily locked for security rea sons after multiple failed attempts.  \nContact customer service to merge accounts; Order history and saved information from both \naccounts will be consolidated into your primary account; You'll need to verify ownership of both \naccounts through email verification; Choose which account you want to  keep as your primary \naccount.  \nSubmit a deletion request through customer service; Account deletion is permanent and cannot be \nundone; We'll delete your personal information while retaining transaction records as required by \nlaw; Consider downloading any order history or information you  want to keep before requesting \ndeletion.  \nTry clearing your browser cache, using a different browser, or contact customer service to complete \nyour order by phone; Common issues include browser compatibility problems, ad blockers \ninterfering with checkout, or temporary website maintenance affecting  certain features.  \nYes, guest checkout is available, but creating an account allows order tracking and easier returns; \nGuest orders require you to enter shipping and billing information each time, and you'll need to save \nyour order confirmation email for future reference or returns.  \nWe store order history, shipping addresses, and encrypted payment method info; See our privacy \npolicy for complete details about data collection, storage, and usage; We never store full credit card \nnumbers - only encrypted tokens that allow for faster chec kout on future orders.  \nClick the unsubscribe link in any marketing email, or manage email preferences in your account \nsettings; You can choose to receive only order -related emails while stopping promotional messages; \nChanges to email preferences typically take 24 -48 hours to tak e effect.  \nForward the email to customer service immediately; This may indicate a system error that needs \ninvestigation; Don't attempt to access someone else's order information; Our team will investigate \nthe issue and ensure proper privacy protection for all custome rs involved.  \nFor security reasons, accounts should only be accessed by the account holder; Consider separate \naccounts for different users to maintain security and privacy; Sharing account credentials can lead to \nsecurity vulnerabilities and makes it difficult to track order history and preferences.  \nInactive accounts are typically retained indefinitely, but we may archive very old accounts with \nadvance notice; Your order history and saved information will remain accessible when you log back \nin; We'll email you before making any changes to inactive acc ounts.  \nWe'll contact you immediately with options: wait for restock, choose a substitute, or cancel with full \nrefund; Most inventory is reserved when you place an order, but occasionally high -demand items \nmay sell out between order placement and processing; We'll  provide estimated restock dates when \navailable.  \nBackorder availability depends on the specific item; Check the product page or contact customer \nservice for availability and estimated restock dates; Some seasonal or discontinued items cannot be \nbackordered, while regular inventory items often can be rese rved for future shipment.  \nRestocking schedules vary by product and supplier; You can sign up for back -in-stock notifications on \nproduct pages to be alerted when items return; Popular items typically restock more frequently, \nwhile specialty or seasonal items may have longer interval s between restocks.  \nContact customer service with photos showing the difference; Significant variations from advertised \nproducts are grounds for return or exchange; We strive for accurate product photography, but \nmonitor colors and lighting can affect how products appear; Man ufacturing variations are also \npossible.  \nYou can submit product requests through customer service; While we can't guarantee addition to our \ninventory, we consider customer feedback for future product decisions; Popular requests that align \nwith our brand and quality standards are more likely to be  considered.  \nContact customer service for bulk orders; We may offer special pricing or expedited processing for \nlarge quantities; Bulk orders often require advance notice to ensure inventory availability and may \nhave different shipping timelines than regular orders.  \nCheck our detailed size charts and product measurements on each product page; When in doubt, \ncontact customer service for fitting advice; Customer reviews often include helpful fit information \nfrom other buyers; Consider ordering multiple sizes if unsure, and return the ones that don't fit.  \nManufacturing defects are covered under our quality guarantee; Contact us with photos for \nimmediate replacement or refund; Defects include issues like broken zippers, loose threads, color \ninconsistencies, or missing components; We'll arrange for a replacem ent without requiring you to \nreturn the defective item first.  \nSample availability varies by product type; Contact customer service to inquire about samples for \nspecific items like fabrics, paint colors, or materials; Some products offer sample sizes or swatches for \npurchase, while others may have samples available up on request for qualified purchases.  \nIf you realize the error quickly, contact customer service within one hour to modify your order before \nshipping; Once shipped, you'll need to use our regular return process to exchange for the correct \nitem; Double -check your selections during checkout to a void these situations.  \nOur customer service team is available Monday -Friday 9 AM -6 PM EST, with limited weekend support \nfor urgent issues; During peak seasons, hours may be extended; Live chat and email support are \navailable during business hours, while phone support has the sam e schedule.  \nWe aim to respond to all emails within 24 hours during business days, with many inquiries answered \nmuch sooner; Complex issues requiring research may take longer to resolve fully; You'll receive an \nautomated confirmation when we receive your email, and urg ent issues are prioritized.  \nYes, you can request to speak with a supervisor if your issue requires escalation or specialized \nassistance; Supervisors handle complex problems, policy exceptions, and situations where initial \ncustomer service attempts haven't resolved the issue to your s atisfaction.  \nCurrently, phone support is available in English; Email support may accommodate other languages on \na case -by-case basis; We're working to expand language support based on customer demand and will \nannounce additional language options as they become availabl e. \nHave your order number, email address, and any relevant photos or documentation ready to \nexpedite assistance; For returns, include details about the issue; For shipping problems, have your \ntracking number available; This information helps our team access y our account and resolve issues \nquickly.  \nAbsolutely! We welcome feedback through customer service, product reviews, or feedback forms on \nthe website; Your input helps us improve our products and services; Both positive feedback and \nconstructive criticism are valuable for enhancing the customer ex perience.  \nContact us again and request to speak with a supervisor; We take service quality seriously and want \nto make things right; Provide details about your previous interaction and what outcome you're \nseeking; Supervisors have additional authority to resolve comp lex situations.  \nYes, live chat is available during business hours; Look for the chat widget on our website for \nimmediate assistance with questions, order status, and basic troubleshooting; Live chat is ideal for \nquick questions that don't require lengthy investigation or complex problem -solving.  \nCallback scheduling may be available during high -volume periods; Check for callback options when \ncalling customer service, or request a callback through live chat or email; We'll call you back during \nbusiness hours at the number you provide.  \nRequest to speak with a manager or use our formal complaint process through customer service for \nserious unresolved issues; Provide documentation of your previous interactions and clearly explain \nwhy you feel the issue hasn't been resolved satisfactorily; Management reviews all escalated \ncomplaints personally.  \nMedical returns may be accepted beyond normal return policies; Contact customer service with \nrelevant documentation from your healthcare provider if needed; We understand that unexpected \nmedical issues can make returns necessary, and we'll work with you to  find an appropriate solution.  \nYes, but you'll need the order information from the gift purchaser, and refunds will go to the original \npayment method; The person who made the purchase can provide you with the order number and \ndetails needed for the return; Gift receipts, when available,  can simplify this process.  \nContact customer service immediately; If the package hasn't shipped, we can update the address; \nOtherwise, you'll need to work with the carrier to arrange forwarding or package interception; \nAddress changes after shipping may involve additional fees charge d by the carrier.  \nYes, you can ship to different addresses, but ensure the billing information matches your payment \nmethod for security verification; This is common for gifts or helping family members; Some payment \nprocessors may flag orders with mismatched billing and ship ping addresses for fraud prevention.  \nContact customer service immediately to cancel the duplicate order; If both orders have shipped, you \ncan return one using our normal return process; Acting quickly increases the chances of canceling \nthe duplicate before it ships, saving you the return proc ess. \nYes, we're committed to accessibility; Contact customer service for assistance with website \nnavigation or placing orders; We can help complete orders over the phone, provide additional \nproduct information, or assist with any accessibility needs you may hav e. \nWe'll work with shipping carriers to hold or reroute packages safely; Contact customer service for \nassistance during emergency situations; Carriers typically suspend delivery to areas affected by \nsevere weather or disasters until it's safe to resume normal  operations.  \nWhile we don't have a formal donation program, you can discuss charitable donation options with \ncustomer service for eligible returns; Some customers prefer this option for lightly used items or \nwhen the return shipping cost exceeds the item value.  \nReport safety concerns immediately to customer service; We take product safety seriously and will \ninvestigate all reports; Provide detailed information about the safety issue, including photos if \nrelevant; We may issue recalls or safety notices if widespre ad issues are identified.  \nOrders placed during maintenance may be delayed in processing; We'll process them as soon as \nsystems are restored and notify affected customers; For urgent orders during outages, contact \ncustomer service to place orders by phone when possible.  \nTypically, only one promo code can be used per order; The system will apply whichever code \nprovides the greater discount when multiple codes are entered; Some special promotions may allow \ncode stacking, but this is clearly stated in the promotion terms.  \nCheck the code's expiration date, minimum purchase requirements, and eligible items; Contact \ncustomer service if a valid code isn't applying properly; Common issues include expired codes, items \nexcluded from the promotion, or not meeting minimum purchase t hresholds.  \nPromo codes must be applied during checkout; We cannot retroactively apply codes to completed \norders; This policy ensures system integrity and prevents exploitation; If you forgot to use a code, \nconsider returning the order and repurchasing with the code i f still valid.  \nWe don't offer price adjustments for items that go on sale after purchase; Consider returning and \nrepurchasing if within the return window and the sale price makes it worthwhile after considering \nreturn shipping costs and effort involved.  \nYes, some items may be excluded from promotions such as new releases, designer items, or already \ndiscounted products; Exclusions are listed in the promotion terms and conditions; Sale and clearance \nitems are typically excluded from additional promotional d iscounts.  \nSubscribe to our email newsletter and follow our social media accounts for the latest promotions and \nexclusive offers; Newsletter subscribers often receive early access to sales and exclusive discount \ncodes not available to the general public.  \nYes, gift cards and promo codes can typically be used together on the same order; Gift card balances \nare applied first, then promo codes are applied to the remaining amount; This combination can \nmaximize your savings on eligible orders.  \nRefunds are processed at the discounted price you paid; The promo code discount is not refunded \nseparately since you received the benefit of the discount on your original purchase; Partial returns \nfrom promotional orders are refunded proportionally.  \nContact customer service to inquire about available discount programs for students, military \npersonnel, or seniors; Verification may be required through third -party services; These discounts, \nwhen available, typically cannot be combined with other promotio nal offers.  \nEach promo code has its own expiration date and terms listed in the promotion details; Some codes \nexpire within days, while others may be valid for weeks or months; Check the specific promotion for \nexact validity periods and any usage restrictions.  \nWe use industry -standard encryption, secure servers, and PCI DSS compliance for payment \nprocessing; Personal information is protected through multiple security layers, including encrypted \ndata transmission, secure data storage, and limited employee access on a need -to-know basis.  \nYes, you can manage privacy preferences in your account settings and opt out of non -essential data \ncollection like marketing analytics; Required information for order processing cannot be opted out of, \nbut optional data collection can be controlled through  your account preferences.  \nWe only share information as outlined in our privacy policy, typically with service providers who help \nfulfill orders like shipping companies and payment processors; We never sell personal information to \nmarketers or unrelated third parties.  \nChange your password immediately and contact customer service; We'll help secure your account \nand investigate any suspicious activity; Review your order history and saved payment methods to \nensure no unauthorized changes have been made.  \nWe retain data as long as necessary for business purposes and legal requirements, typically 7 years \nfor transaction records; Account information is kept while your account is active; See our privacy \npolicy for specific retention periods for different types  of data.  \nYes, you can request a copy of your personal data through customer service; We'll provide this within \n30 days as required by privacy regulations; The report will include account information, order history, \nand any other personal data we maintain.  \nIn the unlikely event of a data breach, we'll notify affected customers immediately and provide \nguidance on protective measures; We maintain incident response plans and work with cybersecurity \nexperts to minimize impact and prevent future breaches.  \nYou can disable analytics cookies through your browser settings or our cookie preference center on \nthe website; This prevents collection of browsing behavior data while still allowing essential website \nfunctionality for order processing and account managem ent. \nWe may use pixels and cookies for advertising purposes to show relevant ads on other websites; You \ncan opt out through your account settings, browser preferences, or industry opt -out tools; This \ntracking helps us show you relevant products but is not requi red for shopping.  \nContact our privacy team through customer service or use the dedicated privacy contact information \nin our privacy policy; We take all privacy concerns seriously and will investigate reports promptly; You \ncan also file complaints with relevant data protecti on authorities if needed.  \nItems returned with clear signs of use, such as stains or tears, or those missing original tags, will not \nbe eligible for a refund; Our team will inspect all returns, and if an item is rejected, we will contact \nyou to arrange for it to be shipped back at y our expense.  \n \nWe offer a one -time price adjustment if an item you purchased at full price goes on sale within 7 \ndays of your order date; This policy does not apply to clearance items or special promotions.  \n \nWe do not charge a restocking fee for most returns; However, special -order items or bulky furniture \nmay be subject to a 15% restocking fee, which will be deducted from your refund.  \n \nYes, if you return an order purchased with loyalty points, those points will be credited back to your \naccount; For partial returns, points are refunded on a pro -rata basis.  \n \nPackages returned to us as undeliverable or refused by the recipient will be processed as a return; \nWe will issue a refund for the item's cost, minus the original shipping fee and any return shipping \ncharges.  \n \nYou can file a warranty claim by contacting customer service with your original order number and \nphotos of the defect; We will guide you through the manufacturer's warranty process or provide a \nreplacement if covered under our policy.  \n \nYes, tax -exempt organizations can apply for tax -free purchasing by submitting their official \ndocumentation to our corporate sales team for verification and account setup.  \n \nOur system requires a signature for orders over $500 or those being delivered to a high -risk area; \nThis cannot be waived, as it protects against theft and ensures your package is delivered securely.  \n \nPre-orders can be cancelled for a full refund anytime up until the item has been processed for \nshipping; Once it has shipped, our standard return policy applies.  \n \nWe do not currently accept cryptocurrencies like Bitcoin; Please refer to our accepted payment \nmethods, which include major credit cards, PayPal, and other digital wallets.  \n \nIf you forgot to add an item, you will need to place a new, separate order; We cannot add items to an \nexisting order once it has been confirmed because our fulfillment process begins immediately.  \n \nIf a loyalty discount or promo code fails to apply, please do not complete the order; Contact our live \nchat support with the code and items in your cart, and they can help troubleshoot or place the order \nfor you.  \n \nIf you receive a package with an item missing, please contact us within 48 hours of delivery; We will \ninvestigate with our warehouse team and either ship the missing item or issue a refund.  \n \nWhile we strive to maintain accurate stock counts, inventory errors can occasionally occur; If an item \nyou ordered is out of stock, we will notify you immediately and offer a refund or an alternative \nproduct.  \n \nYes, you will receive a shipping confirmation email with tracking details as soon as your order leaves \nour warehouse; Please allow up to 24 hours for the tracking information to become active.  \n \nInternational return shipping costs are the responsibility of the customer; We do not provide prepaid \nlabels for international returns unless the item was sent in error or was defective.  \n \nYou can access your full order history, including archived orders from over a year ago, in the \"My \nAccount\" section of our website.  \n \nTo report a phishing email pretending to be from us, please forward it to our security team and \ndelete it immediately; Do not click any links or provide personal information.  \n \nAt this time, orders can only be placed through our website or mobile app; We do not accept orders \nvia phone, mail, or social media to ensure payment security.  \n \nFor security reasons, we cannot change the email address associated with an order after it has been \nplaced; All communications will be sent to the email address provided at checkout.  \n \nIf your payment is authorized but the order fails, this is usually a temporary hold that will disappear \nfrom your statement within 3 -5 business days; It will not be charged.  \n \nProduct care instructions are listed on each product page under the \"Details & Care\" tab; You can \nalso find generalized care guides in our website's help center.  \n \nIf the delivery address you entered is flagged as invalid by our system, we will place your order on \nhold and contact you to verify the correct address before shipping.  \n \nWe reserve the right to limit quantities on high -demand items to ensure fair access for all customers; \nAny orders exceeding the stated limit may be cancelled.  \n \nOur birthday discount is an exclusive offer for our newsletter subscribers and loyalty members; You \nwill receive a unique code via email during your birthday month.  \n \nIf you receive a product that is a different color than shown online, please contact us; Minor \nvariations can occur due to screen settings, but significant differences may be eligible for a free \nexchange.  \n \nWe do not currently have a physical catalog; Our full, up -to-date product selection is available \nexclusively on our website.  \n \nTo close your account permanently, please contact customer service; This action is irreversible and \nwill delete your order history and saved preferences.  \n \nIf you return a gift, the refund will be issued to the original purchaser's payment method; \nAlternatively, we can offer you store credit for the value of the item.  \n \nWe do not offer price matching with other retailers; Our prices are set based on our own sourcing \nand operational costs to provide the best value we can.  \n \nYour invoice is sent electronically via email upon order confirmation; You can also download a PDF \nversion from your order history at any time.  \n \nIf a carrier damages your property during delivery, please report it to us and the carrier directly with \nphotographic evidence; We will assist in facilitating your claim with the shipping company.  \n \nYes, our mobile app may offer exclusive \"app -only\" discounts and early access to sales that are not \navailable on the desktop website.  \n \nWe do not support shipping to freight forwarders, as we cannot guarantee the condition of the \npackage after it leaves their facility; Orders with such addresses may be cancelled.  \n \nThe security code (CVV) on your credit card is required for every purchase and is never stored in our \nsystem, providing an extra layer of security.  \n \nIf a product is recalled for safety reasons, we will contact all affected customers directly via email \nwith instructions on how to receive a refund or replacement.  \n \nOur website is best viewed on the latest versions of modern browsers like Chrome, Firefox, and \nSafari; Using outdated browsers like Internet Explorer may result in functional issues.  \n \nOur privacy policy, which details how we use and protect your data, can be found via a link in the \nfooter of our website.  \n \nYou can leave specific delivery instructions for the carrier in the provided box at checkout, such as \n\"leave on the back porch,\" though we cannot guarantee they will be followed.  \n \nIf your tracking shows \"delivery attempted,\" the carrier will typically try again the next business day; \nAfter multiple failed attempts, the package will be returned to us.  \n \nWe currently ship to all 50 U;S; states and select international countries; Any shipping restrictions will \nbe noted at checkout when you enter your address.  \n \nOnce an order is submitted, you cannot change the size or color of an item; You must cancel the \norder within the one -hour window and place a new one.  \n \nFinal sale or clearance items are not eligible for return or exchange; This is clearly marked on the \nproduct page and at checkout.  \n \nIf you have a subscription for a recurring order, you can pause, modify, or cancel it at any time from \nyour account dashboard.  \n \nWe are required by law to collect sales tax in states where we have a physical or economic presence; \nThe tax amount is calculated based on your shipping address.  \n \nIf you have an accessibility request or need assistance navigating our site with a screen reader, please \ncontact our dedicated support line for help.  \n \nWe do not include a printed invoice in our packages to reduce paper waste; Your order details are \nalways available in your confirmation email and account history.  \n \nIf your card is charged twice for one order, it is usually a pending authorization error; Please contact \nour support team with a screenshot of the charges so we can investigate and correct it.  \n \nGift card balances do not expire and can be used across multiple orders until the full value is \nredeemed.  \n \nIf you have an idea for a product you'd like us to carry, you can submit it through our \"Feedback\" \nform; We review customer suggestions regularly.  \n \nWe do not offer layaway or payment plans, but you may be able to use services like Klarna or \nAfterpay at checkout, depending on your region.  \n \nThe \"estimated delivery\" date is an approximation and not a guarantee; It is based on the shipping \nmethod selected and does not account for carrier delays.  \n \nYou can create and share a public wishlist from your account, which is perfect for birthdays and \nholidays.  \n \nIf a package is stolen after delivery, you should file a report with your local police department; While \nwe are not liable for theft, please contact us to see how we can assist.  \n \nOur loyalty points expire one year after they are earned, so be sure to use them in time.  \n \nTo leave a product review, navigate to the product page and click \"Write a Review\"; You must be \nlogged into your account to post a review.  \n \nWe do not offer wholesale or B2B accounts at this time; All purchases must be made through our \npublic website.  \n \nIf you have trouble uploading photos for a return or warranty claim, please ensure they are in ;JPG or \n;PNG format and under 5MB in size.  \n \nOur customer service team can be reached via live chat, email, or a callback request; We do not have \na direct inbound phone number.  \n \nUsing a VPN may interfere with the checkout process, especially with payment authorization; We \nrecommend disabling it if you encounter issues.  \n \nWe reserve the right to refuse service or cancel orders for customers who exhibit abusive or \nfraudulent behavior.  \n \nYou can find the country of origin and material composition for each product on its dedicated page.  \n \nAny customs duties or import taxes for international orders are the sole responsibility of the \nrecipient and are not included in our shipping fees.  \n \nIf you no longer have the original shipping box, you may use any sturdy, plain box to return your \nitem; Please ensure the item is packed securely.  \n \nPromo codes are for one -time use and cannot be reinstated if you return the order they were used \non. \n \nYou can save multiple shipping addresses to your account for easy checkout when sending gifts to \ndifferent people.  \n \nAn item in your cart is not reserved; It can still sell out before you complete the checkout process.  \n \nWe do not currently offer a student or military discount program.  \n \nIf you receive an item with a security tag still attached, do not try to remove it yourself; Contact us, \nand we will provide instructions for a free exchange.  \n \nOur terms of service can be changed at any time, and continued use of the site constitutes \nacceptance of the new terms.  \n \nIf you need to return a large item that requires freight shipping, please contact us to coordinate the \npickup.  \n \nWe do not provide repair services for products outside of their warranty period.  \n \nYou can see a breakdown of the cost, including item price, taxes, and shipping, before you confirm \nyour order.  \n \nWe are not responsible for delays caused by natural disasters, severe weather, or other events \nbeyond our control.  \n \nIf you see a product on our social media but can't find it on the site, it may be sold out or from a past \nseason.  \n \nSubscribing to our newsletter adds you to our marketing list, but you can unsubscribe at any time \nusing the link in the email footer.  \n \nTwo-factor authentication (2FA) can be enabled in your account settings for an additional layer of \nsecurity.  \n \nIf your account is locked after too many failed login attempts, you will need to reset your password to \nregain access.  \n \nWe do not offer personalization or monogramming services for our products.  \n \nOur packaging materials are made from recycled content and are fully recyclable.  \n \nFor press or media inquiries, please contact our communications department through the \"Media\" \nlink on our website.  \n \nIf you want to collaborate with us as an influencer, you can apply through our affiliate program page.  \n \nWe do not ship hazardous materials or items that are restricted by shipping carriers.  \n \nThe timing of refund processing depends on your bank; It can take up to 10 business days for the \ncredit to appear on your statement after we have issued it.  \n \nWe do not offer in -store pickup for online orders at this time.  \n \nIf you believe your intellectual property has been infringed upon by one of our products, please \ncontact our legal team.  \n \nAll transaction data is encrypted using SSL technology to ensure your information is safe.  \n \nIf you return an item from a \"Buy One, Get One\" promotion, the value of the free item will be \ndeducted from your refund.  \n \nYou cannot apply a promo code to the purchase of a gift card.  \n \nIf your order contains both in -stock and pre -order items, we may ship the in -stock items first at no \nadditional cost.  \n \nDuring peak holiday seasons, order processing and shipping times may be longer than usual; please \nplan accordingly.  \n \nWe do not store your full credit card number on our servers; we only store a secure token provided \nby our payment processor.  \n \nIf a charge from us is declined, please first check with your bank to ensure they are not blocking the \ntransaction before trying again.  \n \nYou can see how many loyalty points you will earn for a purchase on the product page and in your \ncart.  \n \nIf you have a question that is not answered here, our customer service team is happy to help via our \nwebsite's help center.  \n \nWe cannot redirect a package to a new address once it has been shipped; You may be able to arrange \nthis directly with the carrier for a fee.  \n \nOur warranty covers manufacturing defects but not damage from normal wear and tear, accidents, \nor misuse.  \n \nYou can download a data portability report of your personal information from your account's privacy \nsettings.  \n \nItems purchased from third -party sellers, such as on eBay, are not eligible for returns or warranty \ncoverage from us.  \n \nIf you experience a technical glitch on our website, try clearing your browser's cache and cookies, \nwhich often resolves the issue.  \n \nWe list known allergens like nickel in the product specifications; For items where it's a concern, like \ntextiles or cosmetics, we provide a full material or ingredient list; If you have a severe allergy, please \ncontact our support team before purchasing.  \n \nWe are committed to cruelty -free practices; All of our own -brand products are certified cruelty -free \nand are not tested on animals; For third -party brands we carry, we indicate their cruelty -free status \non the product page where applicable.  \n \nWe do not offer in -house assembly services; However, some larger items come with an option to add \nthird -party assembly service at checkout for an additional fee, depending on your location.  \n \nOur packaging is designed to be eco -friendly; The cardboard boxes are 100% recyclable, and any \nplastic fillings are made from recycled materials; Please check with your local recycling program for \nspecific disposal guidelines.  \n \nFor select products like fabrics and flooring, we offer a sample ordering program; If samples are \navailable for an item, you will see a \"Request Sample\" button on its product page.  \n \nCustom and \"Made to Order\" items are built specifically for you and cannot be cancelled, returned, \nor exchanged once the order is placed; The estimated production time is listed on the product page.  \n \nWe strive for accuracy, but please allow for a minor variance of up to 1 inch (or 2 cm) in the listed \ndimensions due to manufacturing tolerances.  \n \nWe will notify all affected customers via email immediately upon learning of a recall; The email will \ncontain detailed instructions on the recall process, including how to receive a replacement, repair, or \nrefund.  \n \nDue to their nature, digital goods are non -refundable once the download link has been accessed or \nthe license key has been revealed.  \n \nOur standard manufacturer warranty is non -transferable and applies only to the original purchaser.  \n \nPlease contact your bank immediately to report the potential fraud, and then notify our customer \nservice team; We will assist your bank's investigation in any way we can.  \n \nWe accept purchase orders from pre -approved educational institutions, government bodies, and \ncorporations; Please contact our B2B sales team to apply for an account with PO terms.  \n \nOur system will automatically attempt to process the payment again three times over five days; We \nwill also notify you by email; If the payment continues to fail, your subscription will be suspended.  \n \nYes, if the item is FSA/HSA eligible, you can download a detailed, itemized receipt from your order \nhistory that meets the standard requirements for reimbursement.  \n \nWe may issue store credit for certain types of returns; Store credit is delivered via a digital code, is \nnon-transferable, and expires 24 months from the date of issue.  \n \nWhen we receive a chargeback, the associated account is temporarily suspended pending \ninvestigation; We provide evidence to the payment processor to validate the charge; We encourage \ncustomers to contact us first to resolve any issues.  \n \nAll transactions are processed in the currency displayed at checkout (e;g;, USD, EUR); While you can \npay with an international card, your bank will handle the currency conversion and may charge a \nforeign transaction fee.  \n \nWhile we facilitate the transaction, your payment agreement is directly with the financing provider; \nYou must contact their customer service to resolve any disputes regarding payments or terms.  \n \nWe cannot delay billing; Payment is captured when the order is placed to reserve the inventory and \ninitiate the fulfillment process.  \n \nPlease provide your tax -exempt certificate to our corporate accounts team; Once your account is \napproved and flagged as tax -exempt, future orders will not be charged sales tax.  \n \nYes, we can ship to a hotel, but we recommend you confirm with the hotel that they accept guest \npackages; Please include your name and check -in dates in the address line to ensure proper delivery.  \n \nWe recommend you thoroughly inspect the product immediately; If it is undamaged, you can keep it; \nIf you discover hidden damage later, please contact us within 48 hours with photos of both the box \nand the product.  \n \nOnce the package is in transit, you can often use the carrier's tracking portal (e;g;, UPS My Choice, \nFedEx Delivery Manager) to request a hold at a local facility for pickup.  \n \nWe do not currently offer a local pickup or \"ship to store\" service; All orders are shipped directly to \nthe address provided at checkout.  \n \nWe strive to ship all items in one package; However, if items are located in different fulfillment \ncenters or if one is a pre -order, your order may be split into multiple shipments at no extra cost to \nyou.  \n \nOnce a package is officially declared lost by the carrier after their investigation, we can expedite a \nreplacement shipment using a faster shipping method at our expense.  \n \nWe cannot ship to international freight forwarders, certain protected territories, or countries under \ntrade embargoes; These restrictions will be flagged during checkout.  \n \nWe do not currently support using a customer's personal or business shipping account for orders \nplaced through our website.  \n \nIf you refuse an international shipment, you will be responsible for the original shipping charges, any \nimport fees incurred, and the cost of returning the package to us; This amount will be deducted from \nyour refund.  \n \nPlease check with your neighbors or building manager first; If you still can't locate it, contact our \nsupport team; We will open an investigation with the carrier to get a detailed delivery confirmation.  \n \nA legally recognized executor can contact us with official documentation (e;g;, a death certificate) to \nrequest account closure and data deletion on behalf of a deceased individual.  \n \nThis alert is sent if our system detects a login from a new device or unusual location; If this was not \nyou, please change your password immediately and contact our security team.  \n \nNo; We strongly recommend you always log out of your account and clear the browser's history after \nusing a shared or public computer to protect your personal information.  \n \nYes; Our team will never ask for your password; We will verify your identity using other information \non your account, such as your billing address, recent order numbers, or the email on file.  \n \nWe only comply with legally binding requests, such as a subpoena or court order; We review all \nrequests for validity and provide only the specific data required by law.  \n \nYes, please contact customer support to request an account merge; You will need to verify ownership \nof both accounts; Please note that order histories will be combined, but some data like reviews may \nnot transfer.  \n \nWhen an account is closed, we permanently delete personal data that is no longer needed; However, \nwe are legally required to retain transactional data (like invoices) for several years for tax and \naccounting purposes.  \n \nWe have a responsible disclosure program; Please report any potential security vulnerabilities to our \ndedicated security email address, listed on our \"Contact Us\" page, and we will investigate promptly.  \n \nWe advise against sharing accounts; Each user should have their own account to ensure order \nhistory, recommendations, and saved information remain private and secure.  \n \nYes, our 2FA system supports both SMS -based codes and time -based codes from standard \nauthenticator apps like Google Authenticator or Authy.  \n \nYou can submit a data access or deletion request through the \"Privacy Settings\" section of your \naccount dashboard or by contacting our customer service team directly.  \n \nOur Terms of Service include a mandatory arbitration clause, which means that in the event of a \ndispute, both parties agree to resolve it through a neutral arbitrator instead of a court of law.  \n \nBy submitting content, you grant us a non -exclusive, royalty -free license to use it on our site and in \nmarketing materials; We reserve the right to moderate and remove content that violates our \ncommunity guidelines.  \n \nWe take brand protection seriously; Please use the \"Report Counterfeit\" form on our legal page to \nprovide us with details, and our brand protection team will investigate.  \n \nFor minor updates, the changes will be posted on our website; For material changes, we will notify \nall active users via email to ensure you are aware of the new terms.  \n \nWe are committed to making our website accessible to all users and strive to meet WCAG 2;1 Level \nAA standards; If you encounter any accessibility barriers, please contact us.  \n \nCustomer service interactions are retained for quality assurance and training purposes for a period of \nup to three years before being archived or anonymized.  \n \nYes; You can manage your cookie preferences through the \"Cookie Settings\" link in our website footer \nto opt out of non -essential analytics and personalization trackers.  \n \nNo; We never sell our customers' personal information; We only share data with essential partners \nrequired for order fulfillment and payment processing, as detailed in our Privacy Policy.  \n \nYes, for quality assurance and training purposes, phone calls with our customer service team may be \nmonitored or recorded; You will be notified of this at the beginning of the call.  \n \nEach contest has its own official rules, which will be linked in the announcement post; Generally, they \nare open to residents of a specific region, and no purchase is necessary to enter.  \n \nReferral bonuses are typically credited after your friend's first purchase has shipped and is past its \nreturn window; Ensure your friend used your unique referral link to make their purchase.  \n \n\"New customer\" promotions are strictly limited to one per person and household; Our system checks \nagainst shipping addresses and payment methods to prevent abuse.  \n \nOur affiliate program allows approved partners to earn a commission on sales generated through a \nunique affiliate link; You can find more details and apply on our \"Affiliates\" page.  \n \nOur system typically allows only one promotional code per order; If two are entered, the one \nproviding the greater discount will be applied.  \n \nYes, our loyalty program is free to join; You can sign up through your account dashboard and start \nearning points on every purchase, which can be redeemed for discounts.  \n \nWe reserve the right to cancel orders that use unauthorized or erroneous promotion codes (e;g;, an \ninternal test code that was leaked); We will notify you and refund your payment in full.  \n \nYes, loyalty points expire 12 months after they are earned if there is no account activity (earning or \nredeeming points) during that period.  \n \nYes; Please contact customer service with your full name and mailing address, and we will remove \nyou from our physical mailing list.  \n \nYes, we have a B2B program that offers tiered pricing, tax -exempt purchasing, and dedicated support \nfor corporate clients; Please apply through our B2B portal.  \n \nOur live chat and phone support are available from 9 AM to 6 PM (local time), Monday to Friday; \nEmail support is available 24/7, with responses typically within one business day.  \n \nCurrently, our primary support is in English; However, we have translation tools for email support and \nmay have multilingual agents available on chat depending on the time of day.  \n \nYou can request to have your issue escalated to a team lead or manager; You can also reference your \nsupport ticket ID in a new inquiry and ask for a review of the case.  \n \nWe analyze customer feedback from surveys, reviews, and support interactions to identify areas for \nimprovement in our products, website, and customer service processes.  \n \nYes; Our website is designed to be screen -reader friendly, and our email and live chat channels are \nfully accessible; We can also accommodate requests through relay services.  \n \nFor urgent issues like order cancellation or address changes, our live chat service during business \nhours is the fastest way to reach an agent.  \n \nYes, at the end of a live chat session, you will be given the option to have a full transcript of the \nconversation emailed to you for your records.  \n \nWe expect all interactions to be respectful; We have a zero -tolerance policy for abusive, threatening, \nor harassing language, and our agents have the right to terminate such conversations.  \n \nEscalated issues are typically resolved within 3 -5 business days; You will be assigned a specific case \nmanager who will provide you with regular updates.  \n \nYour ticket number is included in the subject line of the automated email you receive after \nsubmitting a support request.  \n \nYour cart may clear if your browser's cookies are deleted or if your session expires after a long period \nof inactivity; We recommend creating an account to save your cart across sessions.  \n \nFirst, try clearing your browser's cache and cookies; If the problem persists, try a different browser or \ndevice to see if the issue is isolated; If it continues, please report the bug to our support team.  \n \nYes, some aggressive ad blockers or privacy extensions can interfere with our checkout process or \nsite functionality; We recommend temporarily disabling them if you experience issues.  \n \nWe perform scheduled maintenance during low -traffic hours, typically late at night on weekends; We \nwill post a notice on the site in advance if significant downtime is expected.  \n \nThe mobile app may offer a more streamlined experience, app -exclusive deals, and push notifications \nfor order updates; However, all core features and products are available on both platforms.  \n \nPlease ensure your photo is in ;JPG, ;JPEG, or ;PNG format and is less than 10MB in size; If you \ncontinue to have trouble, please contact our technical support.  \n \nPassword reset links are time -sensitive and can only be used once; Please request a new link; Ensure \nyou are clicking the link from the most recent password reset email you received.  \n \nPrices are subject to change until an order is confirmed; A price may change if a promotional period \nends or if there is a site -wide price update while the item is in your cart.  \n \nPlease use the \"Website Feedback\" form in our help center; Include a description of the issue, the \nbrowser you were using, and a screenshot if possible.  \n \nThis typically means the item is out of stock or you have not yet selected a required option, such as \nsize or color.  \n \nYes, we partner with several non -profit organizations; You can learn more about our CSR initiatives \nand see our annual impact report on our \"Social Responsibility\" page.  \n \nWe are always open to new ideas; Please submit your proposal through the \"Business Inquiries\" form \non our contact page, and the relevant department will review it.  \n \nAll available positions are listed on our \"Careers\" page; We do not accept applications or resumes \nsent to customer support.  \n \nFor all press inquiries, please reach out to the contact listed on our online press room; Customer \nservice cannot handle media requests.  \n \nYes, our corporate gifting program offers curated gift packages, bulk discounts, and custom branding \noptions for businesses; Please contact our corporate sales team for a consultation.  \n \nYes, for large personal orders, please contact our sales team; We may be able to offer a bulk discount \nand will coordinate logistics to ensure everything arrives on time.  \n \nInformation about our company's corporate structure and investor relations can be found on our \n\"About Us\" page.  \n \nWe have a strict supplier code of conduct that prohibits forced labor and requires safe working \nconditions; We conduct regular audits to ensure compliance throughout our supply chain.  \n \nAll content on our website is copyrighted; You may not use our images or text for commercial \npurposes without explicit written permission; For editorial use, please contact our press team.  \n \nYes, digital copies of instruction manuals for most of our products are available for download in the \n\"Product Support\" section of our website.  \n \nSome out -of-stock items are available for backorder, which will be indicated on the product page; For \nothers, you can sign up to be notified by email as soon as the item is restocked.  \n \nThe estimated shipping date for all pre -order items is clearly stated on the product page and at \ncheckout; Please note this date is an estimate and may be subject to change.  \n \nWe are primarily an online retailer; If we have any physical stores or pop -up shops, their locations \nand hours will be listed on our \"Store Locator\" page.  \n \nAbsolutely; We welcome customer suggestions and have a \"Feature Request\" form in our help center \nwhere you can submit your ideas.  \n \nWe encourage honest reviews, whether positive or negative; However, we will remove reviews that \ncontain profanity, personal information, or are not relevant to the product itself.  \n \nThe only official and correct price is the one displayed on our own website at the time of purchase; \nWe are not responsible for pricing information listed on external sites.  \n \nFor many of our products, we do offer common replacement parts like chargers or filters; Please \ncheck the \"Parts & Accessories\" section or contact support for availability.  \n \nOur standard packing slips do not include pricing information, so your gift recipient will not see the \ncost of the items.  \n \nWe provide sustainability details, such as materials used and carbon footprint, on the product pages \nfor our eco -friendly collections.  \n \nOur customer service team is here to help! Please visit our Help Center to browse more topics or to \ncontact an agent via live chat or email.  \n", "metadata": {"source": "data/FAQs.pdf", "file_extension": ".pdf"}}
